class 贺绢户 {
	String 居部 = "葡"; //糕滚, 曼炼, 按眉, 函荐 
	int 啊拜 = 200; //糕滚, 扁夯, 按眉, 函荐 
	贺绢户(){}
	贺绢户(String 居, int 啊){
		居部 = 居;
		啊拜 = 啊; 
		//啊 : 瘤开(颇), 扁夯, X, 函荐 
	}
}
class 酒林赣聪{ 
	int 唱捞;
	贺绢户 户1, 户2;

	酒林赣聪(int 唱){
		唱捞 = 唱;
	}
	void 绷绰促(){
        户1 = new 贺绢户(); //户1:糕滚, 曼炼, 按眉, 函荐   
		System.out.print(
		"居部啊 "+户1.居部+"捞绊, ");
		户2 = new 贺绢户("汲帕", 100);
		System.out.println(
		"居部啊 "+户2.居部+"牢 贺绢户阑 备继绢夸" );
	}
}
class 脚 {
	public static void main(String args[]){
        酒林赣聪 林1 = new 酒林赣聪(45); //林1:瘤开(急檬), 曼炼, X, 函荐  
		System.out.print("楷技啊 " + 林1.唱捞+"技牢 酒林赣聪膊辑 ");
		林1.绷绰促();
	}
}
